{
  "_name_or_path": "facebook/timesformer-base-finetuned-k600",
  "architectures": ["TimesformerForVideoClassification"],
  "attention_probs_dropout_prob": 0.1,
  "attention_type": "divided_space_time",
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "real",
    "1": "fake"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "real": 0,
    "fake": 1
  },
  "layer_norm_eps": 1e-6,
  "model_type": "timesformer",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_frames": 16,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2"
}
